brew "gh"
brew "starship"
brew "neovim"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "fnm"
brew "uv"
brew "go"

cask "proton-mail"
cask "proton-pass"
cask "brave-browser"
cask "spotify"
cask "iina"
cask "visual-studio-code"
cask "ghostty"
cask "karabiner-elements"
cask "alt-tab"
cask "rectangle"
cask "linearmouse" # 0 acceleration, 0.5 mouse sens, 32 scroll sens, middle mouse gesture btn
cask "font-jetbrains-mono-nerd-font"

# upscope

brew "lazydocker"
brew "docker-machine"
brew "docker-compose"
brew "docker-credential-helper"
brew "doctl"
brew "watch"
brew "mutagen-io/mutagen/mutagen"
brew "xwmx/taps/hosts"
